// #qLQLJSeN7i
// - є масив [2,17,13,6,22,31,45,66,100,-18] :
// 1. перебрати його циклом while
// 2. перебрати його циклом for
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
let a = 0;
// 1. перебрати його циклом while
while (a < arr.length) {
    console.log(arr);
    a++;
}
// 2. перебрати його циклом for
for (let i = 0; i < arr.length; i++) {
    const arrElement = arr[i];
    console.log(arr)
}
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
document.write("4. перебрати циклом while та вивести  числа тільки з непарним індексом: <br>");
let i = 1;
while (i < arr.length) {
    document.write(arr[i] + "<br>");
    i += 2;
}
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
document.write("4. перебрати циклом for та вивести  числа тільки з непарним індексом: <br>");
for (let j = 1; j < arr.length; j += 2) {
    const arrElement = arr[j];
    document.write(arr[j] + "<br>")

}
// 5. перебрати циклом while та вивести  числа тільки парні  значення
document.write("5. перебрати циклом while та вивести  числа тільки парні  значення: <br>");
let b = 0;
while (b < arr.length) {
    if (arr[b] % 2 === 0) {
        document.write(arr[b] + "<br>");
    }
    b++;
}
// 6. перебрати циклом for та вивести  числа тільки парні  значення
document.write("5. перебрати циклом for та вивести  числа тільки парні  значення: <br>");
for (let j = 0; j < arr.length; j++) {
    if (arr[j] % 2 === 0) {
        document.write(arr[j] + "<br>");
    }
}

// 8. вивести масив в зворотньому порядку.
document.write("8. вивести масив в зворотньому порядку.: <br>");
for (let i = arr.length - 1; i >= 0; i--) {
    document.write(arr[i] + "<br>");
}
// 7. замінити кожне число кратне 3 на слово "okten"
document.write("7. замінити кожне число кратне 3 на слово \"okten\": <br>");
let c = 0;
while (c < arr.length) {
    if (arr[c] % 3 === 0) {
        arr[c] = 'okten';

    }
    document.write(arr[c] + "<br>");
    c++;
}