// #bq1zkx7WP
// *** (подібне було вище, але...будьте уважні в другій частині) створити сторінку з довільним блоком, в середині якого є значення "100грн"
// при перезавантаженні сторінки до значаення додається по 10грн, але !!!
//     зміна ціни відбувається тільки на перезавантаження, які відбулись пізніше ніж 10 секунд після попереднього.
//     При перезавантаженні, яке відбулось раніше ніж минуло 10 секунд - нічого не відбувається




//!!!!!! Сил тому, хто буде це перевіряти=) Я розумію, що я тут намудрив, але наче працює. Так як розв'язку до цього завдання не було, я викручувався як міг.


// тут ми отримуємо створенний h1
let number = document.getElementById('value');


if (!localStorage.getItem('num')) {          //тут ми перевіряємо чи існує ключ в локальному сховищі, якщо не існує то виконуємо

    let startValue = 100;      // створюємо змінну та даємо їй стандартне значення
    localStorage.setItem('num', startValue);   // додаємо цю змінну в локаль
    number.innerText = startValue + ' ' + 'Грн';    //присвоюємо текст нашій h1

} else {
    number.innerText = localStorage.getItem('num') + ' ' + 'Грн';  //якщо ключ існує то беремо значення по ключу і присвоюємо його нашій h1
}


let time = new Date().getTime();  // створюємо змінну time та присвоюємо їй дату
localStorage.setItem('startTime', time);  // записуємо дату в локаль


if (!localStorage.getItem('savedTime')) {     //тут ми перевіряємо чи існує ключ, якщо не існує, то присвоюємо йому дату,
                                                    // таким чином ми її заморожуємо, так як в майбутньому ця перевірка не буде проходити
    localStorage.setItem('savedTime', time);
}


let savedTime = localStorage.getItem('savedTime'); // отримуємо з локалі наш замороженний час


if (time - savedTime >= 10000) {  //робимо перевірку, якщо нинішній час мінус заморожений час більше або дорівнює 10000 мілісекунд(10 секунд) то виконується умова.

    let newValue = +localStorage.getItem('num') + 10;  //присвоюємо за ключем нове значення збільшене на 10, а саме витягуємо те що вже є, та додаємо до нього 10
    localStorage.setItem('num', newValue);    // зберігаємо нове значення
    localStorage.setItem('savedTime', time); //заморожуємо новий час
    number.innerText = localStorage.getItem('num') + ' ' + 'Грн';   //виводимо значення

} else {          //якщо умова не виконалась то заморожуємо новий час
    localStorage.setItem('savedTime', time);
}






